SaitovSP/src/Documents/НачислениеЗарплаты/НачислениеЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеЗарплаты</name>
  <registerRecords>InformationRegister.ИсторияНачисленияЗароботнойПлаты</registerRecords>
  <registerRecords>AccumulationRegister.ЗароботнаяПлата</registerRecords>
  <attributes>
    <name>Ресторан</name>
    <type>
      <types>CatalogRef.Рестораны</types>
    </type>
  </attributes>
  <attributes>
    <name>Директор</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Зарплаты</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>Оклад</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Премия</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаработнаяПлата</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SaitovSP/src/AccumulationRegisters/СуммаЗаказовКлиенты/СуммаЗаказовКлиенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СуммаЗаказовКлиенты</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Официант</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ресторан</name>
    <type>
      <types>CatalogRef.Рестораны</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

SaitovSP/src/InformationRegisters/РазряднаяСетка/РазряднаяСетка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РазряднаяСетка</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Разряд</name>
    <type>
      <types>CatalogRef.Разряды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ресторан</name>
    <type>
      <types>CatalogRef.Рестораны</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SaitovSP/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <owners>Catalog.Рестораны</owners>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтактныйТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ресторан</name>
    <type>
      <types>CatalogRef.Рестораны</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Разряд</name>
    <type>
      <types>CatalogRef.Разряды</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриемаНаРаботу</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

SaitovSP/src/Documents/НачислениеЗарплаты/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Дата) Тогда
		Объект.Дата = ТекущаяДата();
		Объект.Ресторан = ПараметрыСеанса.ТекущийРесторан;
		Объект.Директор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере() 
	
	//Проверка
	
	
	Объект.Зарплаты.Очистить();

	
	СледующийМесяц = Месяц(ТекущаяДата())+1;
	Если СледующийМесяц > 12 Тогда
		СледующийМесяц = 1;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СуммаЗаказовКлиентыОбороты.Официант КАК Официант,
		|	ВЫБОР
		|		КОГДА СуммаЗаказовКлиентыОбороты.СуммаЗаказаОборот > 200000
		|			ТОГДА СуммаЗаказовКлиентыОбороты.СуммаЗаказаОборот * 0.01
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Премия
		|ПОМЕСТИТЬ ВТ_Премия
		|ИЗ
		|	РегистрНакопления.СуммаЗаказовКлиенты.Обороты(, , Месяц, Ресторан = &Ресторан) КАК СуммаЗаказовКлиентыОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
		|		ПО СуммаЗаказовКлиентыОбороты.Официант = Сотрудники.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Сотрудники.Ссылка КАК Сотрудник,
		|	ЕСТЬNULL(РазряднаяСеткаСрезПоследних.Оклад, 0) КАК Оклад,
		|	ЕСТЬNULL(ВТ_Премия.Премия, 0) + ВЫБОР
		|		КОГДА &СледМесяц = МЕСЯЦ(Сотрудники.ДатаРождения)
		|				И ДЕНЬ(Сотрудники.ДатаРождения) < 8
		|			ТОГДА ЕСТЬNULL(РазряднаяСеткаСрезПоследних.Оклад, 0) * 0.25
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Премия,
		|	ЕСТЬNULL(РазряднаяСеткаСрезПоследних.Оклад, 0) + ЕСТЬNULL(ВТ_Премия.Премия, 0) КАК ЗаработнаяПлата,
		|	Сотрудники.Должность КАК Должность
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазряднаяСетка.СрезПоследних(, ) КАК РазряднаяСеткаСрезПоследних
		|		ПО Сотрудники.Разряд = РазряднаяСеткаСрезПоследних.Разряд
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Премия КАК ВТ_Премия
		|		ПО (ВТ_Премия.Официант = Сотрудники.Ссылка)
		|ГДЕ
		|	Сотрудники.Ресторан = &Ресторан
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сотрудник,
		|	Должность,
		|	Оклад,
		|	Премия,
		|	ЗаработнаяПлата";
	
	Запрос.УстановитьПараметр("СледМесяц", СледующийМесяц);
	Запрос.УстановитьПараметр("Ресторан", ПараметрыСеанса.ТекущийРесторан);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НовСтр = Объект.Зарплаты.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,ВыборкаДетальныеЗаписи);
		
	КонецЦикла;

КонецПроцедуры
